---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
source: html/d46f7519-8b60-d73a-42a0-13e0f4455e62.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound

Defines common set of parameters for structural section round contour.

## Syntax (C#)
```csharp
public class StructuralSectionRound : StructuralSection
```